[{"name":"ENGINEERS & SOCIETY","preReq":"","AU":"3.0 AU","description":"This course discusses the Engineers as professionals, Engineers in Singapore society, Engineers, Technology & Economics and their impact on engineers and  the future of engineering in the region","code":"CZ0001"},{"name":"INTRODUCTION TO COMPUTATIONAL THINKING","preReq":"","AU":"3.0 AU","description":"Introduction to Algorithms and Python; Basic Syntax; Variables and Standard data types; assignment; operators; flow control; numbers and built-in functions; strings and character access; composite types; user defined functions and modules; exceptions; file management; classes and objects.","code":"CZ1003"},{"name":"INTRODUCTION TO COMPUTING SYSTEMS","preReq":"","AU":"2.0 AU","description":"The term `computing systems' is often misinterpreted to mean just personal computers of the desktop, laptop or tablet form. However, computing systems come in many forms from tiny embedded computer systems that drive devices like our mobile phones and cameras to large business computer systems that handle vast amounts of data. There are also large computer systems that drive social networks and search engines and databases and supercomputers that provide high power computing for scientific purposes. The course provides an overview of computing systems and the basis for the further detailed study of the topics in computing systems in the SCSE programmes as well as the appropriate background as a free elective for any other programmes. It also exposes students to computing applications and trends in the real world.","code":"CZ1004"},{"name":"DIGITAL LOGIC","preReq":"","AU":"3.0 AU","description":"Binary variables and logic gates; implementation technologies; combinatorial circuits; binary integers and arithmetic circuits; sequential circuits; simple state machines; digital design using hardware description languages.","code":"CZ1005"},{"name":"COMPUTER ORGANISATION & ARCHITECTURE","preReq":" CZ1005(Corequisite) OR CE1005(Corequisite)","AU":"3.0 AU","description":"Computer Hardware Decomposition; Solid-state memory subsystems; Magnetic memory; Input/Output techniques; The central processor unit; How high level code is `executed?; Quantifying and comparing performance;  Computer arithmetic; Towards higher speed.","code":"CZ1006"},{"name":"DATA STRUCTURES","preReq":" CZ1003 OR CE1003","AU":"3.0 AU","description":"Syntactic and Semantics of basic constructs in `C? language; Data aggregates; Control Abstraction; Linear Structures; Recursion; Implementing the Tree Abstraction; Example of application-specific structures; Memory management in C; Pointers to functions; Implementing other data abstractions.","code":"CZ1007"},{"name":"ENGINEERING MATHEMATICS I","preReq":"","AU":"3.0 AU","description":"Complex Numbers, Vectors, Matrices, Systems of Linear Equations. Descriptive Statistics, Probability Theory, Probability and Sampling Distributions, Inferential Statistics, Experimental and Numerical Methods","code":"CZ1011"},{"name":"ENGINEERING MATHEMATICS II","preReq":" CZ1011(Corequisite)","AU":"3.0 AU","description":"Precalculus, Limits and Continuity, Differentiation, Integration, Ordinary Differential Equations (ODE), Sequences and Series, Function Approximation, Numerical Differentiation and Integration, Fourier Series, Fourier Transform","code":"CZ1012"},{"name":"ADVANCED COMPUTER ARCHITECTURE","preReq":" CZ1006 OR CE1006","AU":"3.0 AU","description":"Processor System Design: CPU interfaces, clock, control, data & address bus; System firmware.The CPU Architecture: including ISA, compiler relationship, control, pipelining, hazards,  CISC/RISC/VLIW and issues of ILP.Memory Systems: cache, virtual memory systems and the MMU, access methods, reliability, error detection/correction.Performance Enhancements: superscalar; branching issues, multithreading, scalability, co-processors and enhancement units.Interfacing and Communications: I/O fundamentals, interrupts and interfacing, buses, protocols and arbitration.Computer Arithmetic: range, precision, real numbers, floating point  and conversion, multi-precision arithmeticMultiprocessing: multiprocessing architectures and interconnections, shared memory and coherence, memory solutionsFuture directions: low power computing; testing, JTAG, system-on-chip and multi-core implementations, embedded systems issues, comparison of computational on CPU, DSP, FPGA and GPU.","code":"CZ3001"},{"name":"SUSTAINABILITY: SEEING THROUGH THE HAZE","preReq":"","AU":"1.0 AU","description":"The course wi ll discuss sustainability from perspectives of various disciplines, including humanities, business, policy, economics, and science. Students will learn about sustainability through a case study of oil palm plantation. The course will be composed of the following 6 modules. The course is supplemented by Module SI , which helps broadening students' perspectives on sustainability.Module I : General IntroductionModule 2: The Global Seeding of Oil PalmModule 3: Recent Expansion of Oil Palm in South East Asia: How and Why did this happen?Module 4: How is Oil Palm Production Affecting Environment, Climate and Human Society?Module 5: Making Oil Palm More SustainableModule 6: General Conclusions                                                                                                                         Module SI: National Geographic (Nat. Geo) talk","code":"GC0001"},{"name":"ENGLISH PROFICIENCY","preReq":" for students who fail QET ","AU":".0 AU","description":"The course aims to help students improve their English language proficiency for use in academic situations.  Tutorials are structured into a 3-wk cycle in which each cycle comprises a blend of workshops, face-to-face and online sessions, and independent study.  Activities are designed to scaffold learning and help students integrate all four language skills, with a focus on writing and speaking.","code":"HW0001"},{"name":"ENGINEERING COMMUNICATION I","preReq":" HW0001(Corequisite)","AU":"2.0 AU","description":"This course covers basic academic literacy skills as well as written and oral communication skills for the field of engineering.","code":"HW0188"},{"name":"DISCRETE MATHEMATICS","preReq":"","AU":"3.0 AU","description":"Elementary Number Theory; Propositional Logic; Sets; Predicate Logic; Linear Recurrence Relation; Relations and Functions; Graphs; Complex Numbers; Vectors and Matrices; Elementary Combinatorics.","code":"MH1812"},{"name":"ABSOLUTE BASICS FOR CAREER","preReq":"","AU":"1.0 AU","description":"In today's competitive world, it is essential that students learn the crucial career skills early to ensure a competitive edge sharpened with a heightened sense of workplace values and ethics.  This course takes students through a journey of career discovery, understanding and polishing of oneself which will then be translated into job application tools such as resumes and interview skills. All students will have the opportunity to undergo a robust Career Assessment Tool, which assesses their career options and career self and helps them chart a career action plan. They will also learn how to identify and articulate the concept of personal branding and applying that to resumes and interviews and online social media. Students will also be exposed to the basics of grooming to ensure that they are aware of the importance of first impressions in all situations.","code":"ML0001"},{"name":"ENGINEERS & SOCIETY","preReq":"","AU":"3.0 AU","description":"This course discusses the Engineers as professionals, Engineers in Singapore society, Engineers, Technology & Economics and their impact on engineers and  the future of engineering in the region","code":"CZ0001"},{"name":"ALGORITHMS","preReq":" U15% & onwards students are also required to read CE/CZ1012 CZ1001 & CZ1007 OR CE1001 & CE1007 OR CE1007 & MH1812 OR CZ1007 & MH1812","AU":"3.0 AU","description":"Introduction to algorithms, basics for analysis of algorithms, sorting, searching, graphs, basic computability and complexity theory","code":"CZ2001"},{"name":"OBJECT ORIENTED DESIGN & PROGRAMMING","preReq":" CZ1007 OR CE1007","AU":"3.0 AU","description":"Introduction to Object Orientated Programming; Interface and implementation; Designing with Classes and Objects; Inheritance and polymorphism; Object Relationships; Framework and Reuse; Persistent Objects; Design patterns; Object Oriented Programming Language","code":"CZ2002"},{"name":"COMPUTER GRAPHICS & VISUALISATION","preReq":" CE1008 OR CZ1008 OR CE1011 OR CZ1011","AU":"3.0 AU","description":"Foundation mathematics for computer graphics; Visual rendering pipeline; Virtual reality Modelling Language (VRML) and Extensible 3D (X3D); Geometric shapes; Transformations and motions; Visual Appearance; Rendering","code":"CZ2003"},{"name":"HUMAN COMPUTER INTERACTION","preReq":"","AU":"3.0 AU","description":"Introduction; Usability and application spaces; Guidelines and principles for text-based interactions; Hardware devices for interaction; Development processes and assessments; Software tools in user interface development; Interaction styles;  Practical UI development concepts; Design Issues","code":"CZ2004"},{"name":"OPERATING SYSTEMS","preReq":" CZ1006 & CZ1007 OR CE1006 & CE1007","AU":"3.0 AU","description":"Overview of Operating Systems (OS); Processes and Threads; Process Scheduling; Deadlock and Starvation; Memory Organization; Virtual Memory Management; File System Organization and Implementation; Input/Output (I/O) Management and Disk Scheduling; Issues in Real-time Operating Systems; Protection and Security","code":"CZ2005"},{"name":"SOFTWARE ENGINEERING","preReq":" CZ2002(Corequisite) OR CE2002(Corequisite)","AU":"3.0 AU","description":"Introduction to Software Engineering; Software Engineering Process; Introduction to Requirements; Introduction to Software Specifications; Software Design and Construction; Testing and Integration; Software Maintenance; Software Project Management; Software Quality; Dependability and Security","code":"CZ2006"},{"name":"INTRODUCTION TO DATABASES","preReq":" CZ1007 & CZ2001(Corequisite) OR CE1007 & CE2001(Corequisite) OR CE1007 & CZ2001(Corequisite) OR CE2001(Corequisite) & CZ1007","AU":"3.0 AU","description":"Overview of Database Management Systems (DBMS); Entity-Relationship Data Model; Relational Data Model; Functional Dependencies (FD) and Normalization; Relational Algebra; Structured Query Language (SQL); Storage of Relational Data; Indexing Techniques; Query Processing and Optimization; Transaction Management and Concurrency Control","code":"CZ2007"},{"name":"ETHICS & MORAL REASONING","preReq":"","AU":"1.0 AU","description":"HY0001 will introduce students to three major ethical theories' utilitarianism, Kant's deontology, and virtue ethics. Then, four weeks will be devoted to teaching the ethical principles underlying academic integrity, research ethics, and intellectual property. Finally, students will discuss issues related to the ethics of environmental sustainability and conservation. All the while, students will be challenged apply the ethical theories learned to concrete moral problems, including world poverty, corporate accountability and whistleblowing, and workplace discrimination.","code":"HY0001"},{"name":"OPERATING SYSTEMS","preReq":" CZ1006 & CZ1007 OR CE1006 & CE1007","AU":"3.0 AU","description":"Overview of Operating Systems (OS); Processes and Threads; Process Scheduling; Deadlock and Starvation; Memory Organization; Virtual Memory Management; File System Organization and Implementation; Input/Output (I/O) Management and Disk Scheduling; Issues in Real-time Operating Systems; Protection and Security","code":"CZ2005"},{"name":"INTRODUCTION TO DATABASES","preReq":" CZ1007 & CZ2001(Corequisite) OR CE1007 & CE2001(Corequisite) OR CE1007 & CZ2001(Corequisite) OR CE2001(Corequisite) & CZ1007","AU":"3.0 AU","description":"Overview of Database Management Systems (DBMS); Entity-Relationship Data Model; Relational Data Model; Functional Dependencies (FD) and Normalization; Relational Algebra; Structured Query Language (SQL); Storage of Relational Data; Indexing Techniques; Query Processing and Optimization; Transaction Management and Concurrency Control","code":"CZ2007"},{"name":"ADVANCED COMPUTER ARCHITECTURE","preReq":" CZ1006 OR CE1006","AU":"3.0 AU","description":"Processor System Design: CPU interfaces, clock, control, data & address bus; System firmware.The CPU Architecture: including ISA, compiler relationship, control, pipelining, hazards,  CISC/RISC/VLIW and issues of ILP.Memory Systems: cache, virtual memory systems and the MMU, access methods, reliability, error detection/correction.Performance Enhancements: superscalar; branching issues, multithreading, scalability, co-processors and enhancement units.Interfacing and Communications: I/O fundamentals, interrupts and interfacing, buses, protocols and arbitration.Computer Arithmetic: range, precision, real numbers, floating point  and conversion, multi-precision arithmeticMultiprocessing: multiprocessing architectures and interconnections, shared memory and coherence, memory solutionsFuture directions: low power computing; testing, JTAG, system-on-chip and multi-core implementations, embedded systems issues, comparison of computational on CPU, DSP, FPGA and GPU.","code":"CZ3001"},{"name":"ADVANCED SOFTWARE ENGINEERING","preReq":" CZ2006 OR CE2006","AU":"3.0 AU","description":"","code":"CZ3002"},{"name":"SOFTWARE SYSTEMS ANALYSIS & DESIGN","preReq":" CZ2006(Corequisite) OR CE2006(Corequisite)","AU":"3.0 AU","description":"","code":"CZ3003"},{"name":"MULTIDISCIPLINARY DESIGN PROJECT","preReq":" Year 3 standing ","AU":"4.0 AU","description":"Seminars and Workshops ? Throughout the MDP, students will be required to attend relevant seminars and workshops that would help them understand the process and tools for designing, developing and marketing of real-world multidisciplinary products. These include both general and technical seminars. General seminars may cover topics such as guided innovation, multidisciplinary problem solving, working effectively in engineering teams, understanding effective marketing strategies, project management, professional, ethical and moral responsibilities etc. Technical seminars and workshops will be related to specific engineering methodology and tools that can help students implement their respective ideas. These may include systems engineering and design, large-scale web systems, embedded systems development tools, etc. In their implementation, students will have to factor in appropriate considerations for public health and safety, cultural, societal factors, environmental and other constraints as well as the needs for sustainable development. Laboratories ? Laboratory during MDP will be a mixed of guided and open accessed sessions. Teams ? Students will be grouped into teams of about 6-7 member. The composition of these team members will consist of a multidisciplinary mix of CS, CE and BCG students.Supervision ? Each team will be assigned a faculty mentor during the MDP.","code":"CZ3004"},{"name":"ARTIFICIAL INTELLIGENCE","preReq":" CZ1003 & CZ2001 OR CE1003 & CE2001 OR CE1003 & CZ2001","AU":"3.0 AU","description":"","code":"CZ3005"},{"name":"NET CENTRIC COMPUTING","preReq":" CZ1006 & CZ2002 OR CE1006 & CE2002","AU":"3.0 AU","description":"","code":"CZ3006"},{"name":"COMPILER TECHNIQUES","preReq":" CZ2001 & CZ2006 OR CE2001 & CE2006","AU":"3.0 AU","description":"","code":"CZ3007"},{"name":"ENTERPRISE & INNOVATION","preReq":"","AU":"1.0 AU","description":"The course will be delivered online, which will include lectures, survey assessment, real-life examples, supplementary materials, and recommended readings. It aims to provide students with a basic appreciation of the key concepts of enterprise and innovation. The course content will empower students to gain practical insights on the relevance of enterprise and innovation in their lives by introducing them to the enterprise and innovation ecosystem of the University, the Singapore society, and beyond.","code":"ET0001"},{"name":"ENGINEERING COMMUNICATION II","preReq":" Year 3 standing HW0188 (Not Applicable to IEM)","AU":"2.0 AU","description":"This course focuses on important concepts in engineering communication and advanced professional communication skills, with reference to: (i)\tTechnical communication and the Final Year Project, and (ii)\tCommunication in the contemporary workplace.","code":"HW0288"},{"name":"CAREER POWER UP!","preReq":" ML0001","AU":"1.0 AU","description":"In today's competitive world, it is essential that students learn the crucial career skills early to ensure they have a competitive edge sharpened with a heightened sense of workplace values and ethics.  This course imparts to students practical skills needed to survive and succeed in the modern workplace while emphasizing on professional ethics. All students will be exposed to effective business communication and workplace skills ranging from building relationship with different personalities, understanding of cross-cultural diversity, inter-cultural communication, conflict management, problem solving and decision making, time management, planning and organization, team work, and more. Following which they will learn how to network and dine with proper etiquette in professional settings. Lastly, to aid them in their transition to the working life, the course will impart the skills behind coping and succeeding in a new workplace, while upholding high standard of work ethics.","code":"ML0002"},{"name":"COMPUTER VISION","preReq":"","AU":"3.0 AU","description":"Image formation and segmentation. Image acquisition. Image representations and organisations. Digital image characterisation. Image enhancement and restoration. Image coding and data compression. Geometry for 3D vision. Pattern recognition using neural networks. Image analysis and understanding. Machine vision applications.","code":"CZ4003"},{"name":"3D MODELLING & ANIMATION","preReq":" CZ2003","AU":"3.0 AU","description":"Introduction to History of computer graphics and animation; applications; Computer Graphics Pipeline; Graphics Programming; Shape Representation; Geometric Processing; Rendering; Basic Animation Techniques; Kinematic Animation; Physics Based Simulation;Motion Capture","code":"CZ4004"},{"name":"ADVANCED TOPICS IN ALGORITHMS","preReq":" CZ2001","AU":"3.0 AU","description":"Advanced Analysis: recurrences and master theorem, potential functions, amortized analysis, online and offline algorithms. Advanced Algorithmic Strategies: dynamic programming, preprocessing, randomization, backtracking, branch-and-bound. Algorithms for Selected Problems: computational geometry, maximum flow, algorithms for symbol sequences; Computational Complexity: lower-bounds, NP-completeness and problem reduction.  Approaches for Hard Problems: heuristic and approximation algorithms, randomized algorithms.","code":"CZ4016"},{"name":"PERSONAL MOBILE NETWORKS","preReq":" CZ3006","AU":"3.0 AU","description":"Digital wireless communication systems are becoming increasingly important in today?s context. With rapid advancements that are being made in digital technology coupled with the flexibility that digital systems offer, it has become evident that these systems will not only out perform analog system but may in the near future replace them.In this subject, the primary focus will be on the physical layer in which emphasis is placed on fundamentals of radio propagation and communication theoretic aspects of different types of multiple access techniques. An introductory exposure of the principles will be covered. Each topic will be followed with problems that reinforce concepts learned and will help develop an improved understanding of wireless mobile communications","code":"CZ4022"},{"name":"ADVANCED COMPUTER NETWORKS","preReq":" CE3005 OR CZ3006","AU":"3.0 AU","description":"Overview of basic concepts of computer networks. Next Generation IP (IPv6) and Next Generation Transport protocol, AQM,. Multicasting, Socket. Principles of application layer protocols.  Real-Time Streaming Protocol (RTSP).RTP, RTCP, RSVP, SIP, P2P. Application layer protocols such as HTTP, FTP, SMTP, Private networks.","code":"CZ4023"},{"name":"DATABASE SYSTEM PRINCIPLES","preReq":" CZ2001 & CZ2007 OR BC2402","AU":"3.0 AU","description":"","code":"CZ4031"},{"name":"DATA ANALYTICS & MINING","preReq":" CZ2001","AU":"3.0 AU","description":"","code":"CZ4032"},{"name":"NEURAL NETWORKS","preReq":" CZ1007 & CZ1011 OR CZ1007 & CZ1008","AU":"3.0 AU","description":"Emphasis is placed on the mathematical analysis of artificial neural network networks, methods of training them and their applications to practical problems in science and engineering.Introduction to neural networksBasic PerceptronMulti-layer perceptron networksPerformance estimation and model selectionKernel-based networksHopfield networksKohonen networksAdaptive resonance theory networks","code":"CZ4042"},{"name":"NATURAL LANGUAGE PROCESSING","preReq":" CZ2001","AU":"3.0 AU","description":"This course introduces natural language processing at a basic level.1.\tBasic concepts of syntax, semantics, and grammar formalisms2.\tBasic techniques of language modelling, part-of-speech tagging, parsing, and semantic analysis3.\tWell-known applications of natural language processing, such as machine translation and information extraction, and their evaluations","code":"CZ4045"},{"name":"COMPUTER SECURITY (SYSTEM SECURITY)","preReq":" CZ2005","AU":"3.0 AU","description":"This course introduces computer security mechanisms at an elementary level.1.\tConcepts and Terminology: security; confidentiality, integrity and availability; security policies; security models; mandatory and discretionary access control; access control matrix, capabilities and access control lists; information flow; 2.\tSecurity Models: information flow policies; role-based access control 3.\tImplementation of Mechanisms: security mechanisms in hardware and operating systems; memory management, memory protection and logical protection; access control lists 4.\tUser authentication: passwords, biometrics and user tokens; identity management 5.\tCase Studies: Intel processor family; Windows; Unix 6.\tOperating system vulnerabilities: how they can be exploited and how they can be prevented 7.\tSoftware security: buffer overflows and exploits; validati","code":"CZ4062"},{"name":"SECURITY MANAGEMENT","preReq":" CZ2006","AU":"3.0 AU","description":"This course introduces security management at an elementary level. The list of topics includes: 1.\tWhat is security and why is it necessary?  2.\tWecurity management - systems, models and frameworks. 3.\tInternal control, audit and security. 4.\tRisk analysis.  5.\tBusiness continuity planning. 6.\tInformation security, governance and the law.","code":"CZ4064"},{"name":"APPLICATION SECURITY","preReq":" CZ2005 & CZ3006","AU":"3.0 AU","description":"The internet has become a convenient platform for commercial transactions executed by application systems. Commercial transactions are obvious targets for criminal activities. Securing such transactions involves multiple parties, hardware components, and protocols which are important to the security of the underlying application systems. Practitioners in this field need to be familiar with current security technologies but also appreciate the respective management tasks and responsibilities of the parties involved.","code":"CZ4068"},{"name":"ENGINEERS & SOCIETY","preReq":"","AU":"3.0 AU","description":"This course raises issues pertinent to engineers as professionals as well as members of society. It discusses the requirements and issues of the IT profession, examining the key role professionals play with their contributions to society. Current concerns will be raised of interest to any person living in Singapore.","code":"CE0001"},{"name":"INTRODUCTION TO COMPUTATIONAL THINKING","preReq":"","AU":"3.0 AU","description":"Introduction to Algorithms and Python; Basic Syntax; Variables and Standard data types; assignment; operators; flow control; numbers and built-in functions; strings and character access; composite types; user defined functions and modules; exceptions; file management; classes and objects.","code":"CE1003"},{"name":"INTRODUCTION TO COMPUTING SYSTEMS","preReq":"","AU":"2.0 AU","description":"The term 'computing systems' is often misinterpreted to mean just personal computers of the desktop, laptop or tablet form. However, computing systems come in many forms from tiny embedded computer systems that drive devices like our mobile phones and cameras to large business computer systems that handle vast amounts of data. There are also large computer systems that drive social networks and search engines and databases and supercomputers that provide high power computing for scientific purposes. The course provides an overview of computing systems and the basis for the further detailed study of the topics in computing systems in the SCSE programmes as well as the appropriate background as a free elective for any other programmes. It also exposes students to computing applications and trends in the real world.","code":"CE1004"},{"name":"DIGITAL LOGIC","preReq":"","AU":"3.0 AU","description":"Binary variables and logic gates; implementation technologies; combinatorial circuits; binary integers and arithmetic circuits; sequential circuits; simple state machines; digital design using hardware description languages.","code":"CE1005"},{"name":"COMPUTER ORGANISATION & ARCHITECTURE","preReq":" CE1005(Corequisite) OR CZ1005(Corequisite)","AU":"3.0 AU","description":"Computer Hardware Decomposition; Solid-state memory subsystems; Magnetic memory; Input/Output techniques; The central processor unit; How high level code is `executed?; Quantifying and comparing performance;  Computer arithmetic; Towards higher speed.","code":"CE1006"},{"name":"DATA STRUCTURES","preReq":" CE1003 OR CZ1003","AU":"3.0 AU","description":"Syntactic and Semantics of basic constructs in `C? language; Data aggregates; Control Abstraction; Linear Structures; Recursion; Implementing the Tree Abstraction; Example of application-specific structures; Memory management in C; Pointers to functions; Implementing other data abstractions.","code":"CE1007"},{"name":"ENGINEERING MATHEMATICS I","preReq":"","AU":"3.0 AU","description":"Complex Numbers, Vectors, Matrices, Systems of Linear Equations. Descriptive Statistics, Probability Theory, Probability and Sampling Distributions, Inferential Statistics, Experimental and Numerical Methods","code":"CE1011"},{"name":"ENGINEERING MATHEMATICS II","preReq":" CE1011(Corequisite)","AU":"3.0 AU","description":"Precalculus, Limits and Continuity, Differentiation, Integration, Ordinary Differential Equations (ODE), Sequences and Series, Function Approximation, Numerical Differentiation and Integration, Fourier Series, Fourier Transform","code":"CE1012"},{"name":"ADVANCED COMPUTER ARCHITECTURE","preReq":" CE1006 OR CZ1006","AU":"3.0 AU","description":"Processor System Design: CPU interfaces, clock, control, data & address bus; System firmware.The CPU Architecture: including ISA, compiler relationship, control, pipelining, hazards,  CISC/RISC/VLIW and issues of ILP.Memory Systems: cache, virtual memory systems and the MMU, access methods, reliability, error detection/correction.Performance Enhancements: superscalar; branching issues, multithreading, scalability, co-processors and enhancement units.Interfacing and Communications: I/O fundamentals, interrupts and interfacing, buses, protocols and arbitration.Computer Arithmetic: range, precision, real numbers, floating point  and conversion, multi-precision arithmeticMultiprocessing: multiprocessing architectures and interconnections, shared memory and coherence, memory solutionsFuture directions: low power computing; testing, JTAG, system-on-chip and multi-core implementations, embedded systems issues, comparison of computational on CPU, DSP, FPGA and GPU.","code":"CE3001"},{"name":"COMPUTER NETWORKS","preReq":" CE1008 OR CZ1008 OR CE1011 & CE1012 OR CZ1011 & CZ1012","AU":"3.0 AU","description":"Open system interconnect reference model network architecture. TCP/IP protocol suite and its operation. Protocols and standards at different layers. HDLC protocol. Local area networks. Performance analysis. Internetworking. Routing. Congestion control. X.25. Frame-relay network. ATM. Internet protocol. TCP and UDP protocols. The roles of transport and applications layers. Network applications.","code":"CE3005"},{"name":"SUSTAINABILITY: SEEING THROUGH THE HAZE","preReq":"","AU":"1.0 AU","description":"The course wi ll discuss sustainability from perspectives of various disciplines, including humanities, business, policy, economics, and science. Students will learn about sustainability through a case study of oil palm plantation. The course will be composed of the following 6 modules. The course is supplemented by Module SI , which helps broadening students' perspectives on sustainability.Module I : General IntroductionModule 2: The Global Seeding of Oil PalmModule 3: Recent Expansion of Oil Palm in South East Asia: How and Why did this happen?Module 4: How is Oil Palm Production Affecting Environment, Climate and Human Society?Module 5: Making Oil Palm More SustainableModule 6: General Conclusions                                                                                                                         Module SI: National Geographic (Nat. Geo) talk","code":"GC0001"},{"name":"ENGLISH PROFICIENCY","preReq":" for students who fail QET ","AU":".0 AU","description":"The course aims to help students improve their English language proficiency for use in academic situations.  Tutorials are structured into a 3-wk cycle in which each cycle comprises a blend of workshops, face-to-face and online sessions, and independent study.  Activities are designed to scaffold learning and help students integrate all four language skills, with a focus on writing and speaking.","code":"HW0001"},{"name":"ENGINEERING COMMUNICATION I","preReq":" HW0001(Corequisite)","AU":"2.0 AU","description":"This course covers basic academic literacy skills as well as written and oral communication skills for the field of engineering.","code":"HW0188"},{"name":"DISCRETE MATHEMATICS","preReq":"","AU":"3.0 AU","description":"Elementary Number Theory; Propositional Logic; Sets; Predicate Logic; Linear Recurrence Relation; Relations and Functions; Graphs; Complex Numbers; Vectors and Matrices; Elementary Combinatorics.","code":"MH1812"},{"name":"ABSOLUTE BASICS FOR CAREER","preReq":"","AU":"1.0 AU","description":"In today's competitive world, it is essential that students learn the crucial career skills early to ensure a competitive edge sharpened with a heightened sense of workplace values and ethics.  This course takes students through a journey of career discovery, understanding and polishing of oneself which will then be translated into job application tools such as resumes and interview skills. All students will have the opportunity to undergo a robust Career Assessment Tool, which assesses their career options and career self and helps them chart a career action plan. They will also learn how to identify and articulate the concept of personal branding and applying that to resumes and interviews and online social media. Students will also be exposed to the basics of grooming to ensure that they are aware of the importance of first impressions in all situations.","code":"ML0001"},{"name":"ALGORITHMS","preReq":" U15% & onwards students are also required to read CE/CZ1012 CE1001 & CE1007 OR CZ1001 & CZ1007 OR CE1007 & MH1812 OR CZ1007 & MH1812","AU":"3.0 AU","description":"Introduction to algorithms, basics for analysis of algorithms, sorting, searching, graphs, basic computability and complexity theory","code":"CE2001"},{"name":"OBJECT ORIENTED DESIGN & PROGRAMMING","preReq":" CE1007 OR CZ1007","AU":"3.0 AU","description":"Introduction to Object Orientated Programming; Interface and implementation; Designing with Classes and Objects; Inheritance and polymorphism; Object Relationships; Framework and Reuse; Persistent Objects; Design patterns; Object Oriented Programming Language","code":"CE2002"},{"name":"DIGITAL SYSTEMS DESIGN","preReq":" CE1005 OR CZ1005","AU":"3.0 AU","description":"Review of Hardware Description Languages; Real-World Arithmetic; Control and Datapath design; Register Transfer Level (RTL) design in Verilog; Digital Design on FPGAs; Testbenches and Testing Strategies; Using design in registers, counters, shift registers, synchronous and asynchronous reset","code":"CE2003"},{"name":"CIRCUITS & SIGNAL ANALYSIS","preReq":" CE1008 OR CZ1008 OR CE1012 OR CZ1012","AU":"3.0 AU","description":"Introduction to Signals & Systems; Basic DC Circuit Theory; Operational Amplifiers; Basic AC Circuit Theory; Time domain representation; Laplace transform; Applications of Laplace transform; Fourier series.","code":"CE2004"},{"name":"OPERATING SYSTEMS","preReq":" CE1006 & CE1007 OR CZ1006 & CZ1007","AU":"3.0 AU","description":"Overview of Operating Systems (OS); Processes and Threads; Process Scheduling; Deadlock and Starvation; Memory Organization; Virtual Memory Management; File System Organization and Implementation; Input/Output (I/O) Management and Disk Scheduling; Issues in Real-time Operating Systems; Protection and Security.","code":"CE2005"},{"name":"SOFTWARE ENGINEERING","preReq":" CE2002(Corequisite) OR CZ2002(Corequisite)","AU":"3.0 AU","description":"Introduction to Software Engineering; Software Engineering Process; Introduction to Requirements; Introduction to Software Specifications; Software Design and Construction; Testing and Integration; Software Maintenance; Software Project Management; Software Quality; Dependability and Security","code":"CE2006"},{"name":"MICROPROCESSOR-BASED SYSTEMS DESIGN","preReq":" CE1006 & CE2004(Corequisite)","AU":"3.0 AU","description":"Microprocessor packages and pins; FPGA soft-core processors; Memory technology and characteristics; Digital peripherals and applications; Sensors and analogue signal conditioning; Data conversion; Actuator control; Displays; Higher integration for speed, electrical  power, or density;  Practical issues.","code":"CE2007"},{"name":"ETHICS & MORAL REASONING","preReq":"","AU":"1.0 AU","description":"HY0001 will introduce students to three major ethical theories' utilitarianism, Kant's deontology, and virtue ethics. Then, four weeks will be devoted to teaching the ethical principles underlying academic integrity, research ethics, and intellectual property. Finally, students will discuss issues related to the ethics of environmental sustainability and conservation. All the while, students will be challenged apply the ethical theories learned to concrete moral problems, including world poverty, corporate accountability and whistleblowing, and workplace discrimination.","code":"HY0001"},{"name":"ADVANCED COMPUTER ARCHITECTURE","preReq":" CE1006 OR CZ1006","AU":"3.0 AU","description":"Processor System Design: CPU interfaces, clock, control, data & address bus; System firmware.The CPU Architecture: including ISA, compiler relationship, control, pipelining, hazards,  CISC/RISC/VLIW and issues of ILP.Memory Systems: cache, virtual memory systems and the MMU, access methods, reliability, error detection/correction.Performance Enhancements: superscalar; branching issues, multithreading, scalability, co-processors and enhancement units.Interfacing and Communications: I/O fundamentals, interrupts and interfacing, buses, protocols and arbitration.Computer Arithmetic: range, precision, real numbers, floating point  and conversion, multi-precision arithmeticMultiprocessing: multiprocessing architectures and interconnections, shared memory and coherence, memory solutionsFuture directions: low power computing; testing, JTAG, system-on-chip and multi-core implementations, embedded systems issues, comparison of computational on CPU, DSP, FPGA and GPU.","code":"CE3001"},{"name":"SENSORS, INTERFACING & CONTROL","preReq":" CE2004","AU":"3.0 AU","description":"Introduction: Principles of Sensors and Transducers, Temperature and Displacement Transducers.The Basic Transistor Amplifier: Transistor operation as a linear device, Limitations.Operational Amplifiers: Op-Amp Basics, Signal Conditioning Circuits ? Non-Inverting, Inverting amplifiers, Buffer, Summation, Difference and Instrumentation amplifiers, Op-Amp Specifications, Signal conditioning circuit design.Passive and Active Filters: Low-pass, High-pass, Band-pass and Band-reject filters, Integration and Differentiation functionalities of filters, Filter Design.Signal Conversion: Analog-to-Digital Converter and Digital-to-Analog Converter.Control Systems: Elements of a feedback control system, Sampled data control system, Proportional, Integral, Derivative Controllers, Stability, Computers in Process Control.","code":"CE3002"},{"name":"MICROCONTROLLER PROGRAMMING","preReq":" CE2005 OR CZ2005","AU":"3.0 AU","description":"Discrete-time signals: Conversion of analogue signals to discrete time representation, digital representation of signals, sampling and sampling theorem, aliasing introduced by sampling, reconstruction of signals, sample rate conversion. Z-transform: Z-transform, properties of z-transforms, transfer functions, bilinear transformation, causality and stability, determining frequency response from poles and zeroes. Fourier Transform: Discrete-time Fourier transform, properties of Fourier transforms, Fourier transforms for periodic signals and applications of the Fourier transformsBasic DSP Concepts: Meaning of frequency in discrete-time signals, discrete-time frequency analysis, DTFT and DFT, how to interpret DFT (cycles/sample vs. cycles/sec, zero-padding, spectral leakage and windowing), fast algorithms (FFT) for spectral analysis, discrete-time filters (moving average, autoregressive, and their combination).Analysis and design of digital filters: Analysis of filters, impulse response, frequency response (magnitude vs. phase, ripple and group delay), FIR vs. IIR, stability of IIR filters, motivation for Z-transform, pole-zero analysis, design of FIR filters to specification (windowing and optimization techniques), design of IIR filters, classical designs (Butterworth, Chebyshev, etc)Architectures and implementation: Algorithms for implementing filters, Convolution, correlation and their implementation, quantization, , quantization noise, factors affecting quantization of filter coefficients and practical issues such as limit-cycles and dead bands, up sampling and down sampling (how a 1-bit ADC and DAC work)Examples and applications: Audio processing examples using DSP (equalization and reverb), speech processing examples (The spectrogram implementation methods in software and hardware (DSP architectures).  Matlab exercises will accompany each of the aboveLab sessions will involve implementing DSP applications on a suitable DSP Chip.","code":"CE3003"},{"name":"MULTIDISCIPLINARY DESIGN PROJECT","preReq":" Year 3 standing ","AU":"4.0 AU","description":"Seminars and Workshops ? Throughout the MDP, students will be required to attend relevant seminars and workshops that would help them understand the process and tools for designing, developing and marketing of real-world multidisciplinary products. These include both general and technical seminars. General seminars may cover topics such as guided innovation, multidisciplinary problem solving, working effectively in engineering teams, understanding effective marketing strategies, project management, professional, ethical and moral responsibilities etc. Technical seminars and workshops will be related to specific engineering methodology and tools that can help students implement their respective ideas. These may include systems engineering and design, large-scale web systems, embedded systems development tools, etc. In their implementation, students will have to factor in appropriate considerations for public health and safety, cultural, societal factors, environmental and other constraints as well as the needs for sustainable development.","code":"CE3004"},{"name":"COMPUTER NETWORKS","preReq":" CE1008 OR CZ1008 OR CE1011 & CE1012 OR CZ1011 & CZ1012","AU":"3.0 AU","description":"Open system interconnect reference model network architecture. TCP/IP protocol suite and its operation. Protocols and standards at different layers. HDLC protocol. Local area networks. Performance analysis. Internetworking. Routing. Congestion control. X.25. Frame-relay network. ATM. Internet protocol. TCP and UDP protocols. The roles of transport and applications layers. Network applications.","code":"CE3005"},{"name":"DIGITAL COMMUNICATIONS","preReq":" CE1008 & CE2004 OR CE1011 & CE2004 OR CE2004 & CZ1011","AU":"3.0 AU","description":"Signal analysis. Signal transmission. Random signal and noise. Baseband data transmission. Bandwidth consideration. Digital modulation systems (amplitude-shift keying, phase-shift keying and frequency-shift keying). Data and phase synchronization. Data multiplexing. Error control techniques. Information theory and source coding.","code":"CE3006"},{"name":"DIGITAL SIGNAL PROCESSING","preReq":" CE2004","AU":"3.0 AU","description":"","code":"CE3007"},{"name":"ENTERPRISE & INNOVATION","preReq":"","AU":"1.0 AU","description":"The course will be delivered online, which will include lectures, survey assessment, real-life examples, supplementary materials, and recommended readings. It aims to provide students with a basic appreciation of the key concepts of enterprise and innovation. The course content will empower students to gain practical insights on the relevance of enterprise and innovation in their lives by introducing them to the enterprise and innovation ecosystem of the University, the Singapore society, and beyond.","code":"ET0001"},{"name":"ENGINEERING COMMUNICATION II","preReq":" Year 3 standing HW0188 (Not Applicable to IEM)","AU":"2.0 AU","description":"This course focuses on important concepts in engineering communication and advanced professional communication skills, with reference to: (i)\tTechnical communication and the Final Year Project, and (ii)\tCommunication in the contemporary workplace.","code":"HW0288"},{"name":"CAREER POWER UP!","preReq":" ML0001","AU":"1.0 AU","description":"In today's competitive world, it is essential that students learn the crucial career skills early to ensure they have a competitive edge sharpened with a heightened sense of workplace values and ethics.  This course imparts to students practical skills needed to survive and succeed in the modern workplace while emphasizing on professional ethics. All students will be exposed to effective business communication and workplace skills ranging from building relationship with different personalities, understanding of cross-cultural diversity, inter-cultural communication, conflict management, problem solving and decision making, time management, planning and organization, team work, and more. Following which they will learn how to network and dine with proper etiquette in professional settings. Lastly, to aid them in their transition to the working life, the course will impart the skills behind coping and succeeding in a new workplace, while upholding high standard of work ethics.","code":"ML0002"},{"name":"COMPUTER VISION","preReq":"","AU":"3.0 AU","description":"Image formation and segmentation. Image acquisition. Image representations and organisations. Digital image characterisation. Image enhancement and restoration. Image coding and data compression. Geometry for 3D vision. Pattern recognition using neural networks. Image analysis and understanding. Machine vision applications.","code":"CE4003"},{"name":"3D MODELLING & ANIMATION","preReq":" CZ2003","AU":"3.0 AU","description":"Introduction to History of computer graphics and animation; applications; Computer Graphics Pipeline; Graphics Programming; Shape Representation; Geometric Processing; Rendering; Basic Animation Techniques; Kinematic Animation; Physics Based Simulation;Motion Capture","code":"CE4004"},{"name":"ADVANCED TOPICS IN ALGORITHMS","preReq":" CE2001","AU":"3.0 AU","description":"Advanced Analysis: recurrences and master theorem, potential functions, amortized analysis, online and offline algorithms. Advanced Algorithmic Strategies: dynamic programming, preprocessing, randomization, backtracking, branch-and-bound. Algorithms for Selected Problems: computational geometry, maximum flow, algorithms for symbol sequences; Computational Complexity: lower-bounds, NP-completeness and problem reduction.  Approaches for Hard Problems: heuristic and approximation algorithms, randomized algorithms.","code":"CE4016"},{"name":"PERSONAL MOBILE NETWORKS","preReq":" CE3005 OR CZ3006","AU":"3.0 AU","description":"Digital wireless communication systems are becoming increasingly important in today?s context. With rapid advancements that are being made in digital technology coupled with the flexibility that digital systems offer, it has become evident that these systems will not only out perform analog system but may in the near future replace them.In this subject, the primary focus will be on the physical layer in which emphasis is placed on fundamentals of radio propagation and communication theoretic aspects of different types of multiple access techniques. An introductory exposure of the principles will be covered. Each topic will be followed with problems that reinforce concepts learned and will help develop an improved understanding of wireless mobile communications","code":"CE4022"},{"name":"ADVANCED COMPUTER NETWORKS","preReq":" CE3005 OR CZ3006","AU":"3.0 AU","description":"Overview of basic concepts of computer networks. Principles of application layer protocols. Application layer protocols such as HTTP, FTP, SMTP, DNS, Private networks. Best-effort service. Multimedia applications and QoS requirements. Real-Time Streaming Protocol (RTSP).RTP, RTCP, RSVP. Integrated services. Differentiated services. Scheduling and traffic policing. TCP and UDP, in depth study of TCP congestion control. IPv6. Multicasting. Frame relay protocol and QoS. ATM and current status of ATM networks. Virtual LANs. Wireless networks: Architectures, MAC layer protocols (such as IEEE 802.11, Bluetooth). Routing and transport protocols. Application layer protocols (such as WAP).","code":"CE4023"},{"name":"DATABASE SYSTEM PRINCIPLES","preReq":" CE2001 & CZ2007","AU":"3.0 AU","description":"","code":"CE4031"},{"name":"DATA ANALYTICS & MINING","preReq":" CE2001","AU":"3.0 AU","description":"","code":"CE4032"},{"name":"NEURAL NETWORKS","preReq":" CE1007 & CE1011 OR CE1007 & CE1008","AU":"3.0 AU","description":"Emphasis is placed on the mathematical analysis of artificial neural network networks, methods of training them and their applications to practical problems in science and engineering.Introduction to neural networksBasic PerceptronMulti-layer perceptron networksPerformance estimation and model selectionKernel-based networksHopfield networksKohonen networksAdaptive resonance theory networks","code":"CE4042"},{"name":"NATURAL LANGUAGE PROCESSING","preReq":" CE2001","AU":"3.0 AU","description":"This course introduces natural language processing at a basic level.1.\tBasic concepts of syntax, semantics, and grammar formalisms2.\tBasic techniques of language modelling, part-of-speech tagging, parsing, and semantic analysis3.\tWell-known applications of natural language processing, such as machine translation and information extraction, and their evaluations","code":"CE4045"},{"name":"EMBEDDED SYSTEMS DESIGN","preReq":" CE2003 & CE3001 OR CE2003 & CZ3001","AU":"3.0 AU","description":"This course covers the following topics:Introduction to embedded systems Embedded systems hardwareEmbedded systems softwareMarket issues in embedded systems designSystem level issues and emerging methodologiesCase studies","code":"CE4051"},{"name":"EMBEDDED SOFTWARE DEVELOPMENT","preReq":" CE2006 & CE3001 OR CE2006 & CZ3001","AU":"3.0 AU","description":"Introduction to Embedded Systems Programming; The Android Ecosystem; Software Design and Management; Profiling & Optimization; Hardware Acceleration; Multi-Threading; Scheduling & Prioritisation; Advanced Topics.","code":"CE4052"},{"name":"COMPUTER SECURITY (SYSTEM SECURITY)","preReq":" CE2005","AU":"3.0 AU","description":"This course introduces computer security mechanisms at an elementary level.1.\tConcepts and Terminology: security; confidentiality, integrity and availability; security policies; security models; mandatory and discretionary access control; access control matrix, capabilities and access control lists; information flow; 2.\tSecurity Models: information flow policies; role-based access control 3.\tImplementation of Mechanisms: security mechanisms in hardware and operating systems; memory management, memory protection and logical protection; access control lists 4.\tUser authentication: passwords, biometrics and user tokens; identity management 5.\tCase Studies: Intel processor family; Windows; Unix 6.\tOperating system vulnerabilities: how they can be exploited and how they can be prevented 7.\tSoftware security: buffer overflows and exploits; validati","code":"CE4062"},{"name":"SECURITY MANAGEMENT","preReq":" CE2006","AU":"3.0 AU","description":"This course introduces security management at an elementary level. The list of topics includes: 1.\tWhat is security and why is it necessary?  2.\tWecurity management - systems, models and frameworks. 3.\tInternal control, audit and security. 4.\tRisk analysis.  5.\tBusiness continuity planning. 6.\tInformation security, governance and the law.","code":"CE4064"},{"name":"APPLICATION SECURITY","preReq":" CE2005 & CE3005","AU":"3.0 AU","description":"The internet has become a convenient platform for commercial transactions executed by application systems. Commercial transactions are obvious targets for criminal activities. Securing such transactions involves multiple parties, hardware components, and protocols which are important to the security of the underlying application systems. Practitioners in this field need to be familiar with current security technologies but also appreciate the respective management tasks and responsibilities of the parties involved.","code":"CE4068"}]